blog/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("First_Name", "Last_Name", "Email", "Notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["First_Name", "Guying"], ["Last_Name", "Zan"], ["Email", "gzan@sfu.ca"], ["Notes", ""], ["created_at", "2015-11-07 07:26:14.636859"], ["updated_at", "2015-11-07 07:26:14.636859"]]
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save