webroot/app/views/movies/show.html.erb

SELECT  "movies".* FROM "movies" WHERE "movies"."movieid" = $1 LIMIT 1  [["movieid", 1]]
---

    $("#upvote_panel").click(function() {
      if (vote_status == -1){ //currently down voted
        $.ajax({
          type: "PATCH",
          url: url,
          data: {'vote' : '2',},
          dataType: "json",
          success: function() {
              $('#downvote_img').attr("src", "<%= asset_path 'downvote_g.png' %>");
              $('#upvote_img').attr("src", "<%= asset_path 'upvote.png' %>");
              $("#vote_value").load("<%= @movie.movieid %> #vote_value");
              vote_status = 1;
          }
        });
      }
      else if (vote_status == 0){ //currently not voted
        $.ajax({
          type: "PATCH",
          url: url,
          data: {'vote' : '1',},
          dataType: "json",