app/controllers/actors_controller.rb

  def show
    @actor = Actor.find(params[:id])
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 2]]