app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title like '%%')  ORDER BY created_at DESC
---
  def index
    @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE (title like '%aa%')  ORDER BY created_at DESC
---
  def search
  	if params[:search]
      @movies = Movie.search(params[:search]).order("title DESC")

INSERT INTO "movies" ("title", "image", "release_year", "plot", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hello"], ["image", "hello"], ["release_year", "hello"], ["plot", "hello"], ["created_at", "2015-11-17 22:32:20.689489"], ["updated_at", "2015-11-17 22:32:20.689489"]]
---
  def create
	  @movie = Movie.new(movie_params)
	  if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
  	@movie = Movie.find(params[:id])  #find by id then display the single moive

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "image" = ?, "release_year" = ?, "plot" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "title zzzz"], ["image", "urllll"], ["release_year", "year"], ["plot", "plotttttttt"], ["updated_at", "2015-11-18 01:24:06.355319"], ["id", 23]]
---
  def update
    @movie = Movie.find(params[:id])
      if @movie.update(movie_params)