webroot/app/controllers/main_controller.rb

SELECT  "movies".* FROM "movies"  ORDER BY "movies"."movieid" DESC LIMIT 5
---
  def index
    @movies = Movies.last(5)