webroot/app/controllers/movies_controller.rb

  def index
    @movies = Movies.all
---
SELECT "movies".* FROM "movies"

  def search
    if params[:search]
      @movies = Movies.search(params[:search]).order("title ASC")
---
SELECT "movies".* FROM "movies" WHERE (title like '%a%')  ORDER BY title DESC

  def show
    @movie = Movies.find(params[:movieID])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."movieid" = $1 LIMIT 1  [["movieid", 1]]

  def edit
    @movie = Movies.find(params[:movieID])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."movieid" = $1 LIMIT 1  [["movieid", 4]]

  def update
    @movie = Movies.find(params[:movieID])
    if params[:vote].present? # if params.has_key?(title) #update vote attr
        respond_to do |format|
          format.html
          format.xml  { render :xml => '' }
          format.json { render :json => '' }
        end
        @movie.increment!(:rating,params[:vote].to_i)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."movieid" = $1 LIMIT 1  [["movieid", 4]]
UPDATE "movies" SET "title" = $1 WHERE "movies"."movieid" = $2  [["title", "jjjjjjjjj"], ["movieid", 4]]