webroot/app/controllers/movies_controller.rb

  def show
    @movie = Movies.find(params[:movieID])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]