webroot/app/controllers/watchlist_controller.rb

SELECT * FROM "watchlists" INNER JOIN movies on watchlists.movieid = movies.movieid
---
  def index
    @watchlist = Watchlists.select("*").joins("INNER JOIN movies on watchlists.movieid = movies.movieid")