webroot/app/controllers/watchlist_controller.rb

SELECT * FROM "watchlists"
---
  def index
    @watchlist = Watchlists.select("*")